Revit 2027 API
Gradient.GradientColor Property
 The property labeled "Color" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientColor { get; }
Public Shared ReadOnly Property GradientColor As String
	Get
public:
static property String^ GradientColor {
	String^ get ();
}
static member GradientColor : string with get
Property Value
String
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace